Конфигурация/InformationRegisters/ПеречниОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПеречниОбъектов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ПеречниОбъектов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)

	Элементы = Форма.Элементы;
	Запись   = Форма.Запись;
	
	ЭтоСписокЦБ = Запись.ВидПеречня = ПредопределенноеЗначение("Справочник.ВидыПеречнейОбъектов.СписокЦенныхБумагДляИмпортаКотировок");
	
	Элементы.ВнешняяСистема.Видимость	= НЕ ЭтоСписокЦБ;
	Элементы.ВидПеречня.Видимость		= НЕ ЭтоСписокЦБ;
	Элементы.ДатаОбновления.Видимость	= НЕ ЭтоСписокЦБ;
	Элементы.Ответственный.Видимость	= НЕ ЭтоСписокЦБ;
	Элементы.Источник.Видимость			= НЕ ЭтоСписокЦБ;
	
	Элементы.Объект.Заголовок	= ?(ЭтоСписокЦБ, "Ценная бумага", "");
	Форма.Заголовок				= ?(ЭтоСписокЦБ, "Импорт котировок Bloomberg", "");
	Форма.АвтоЗаголовок		= НЕ ЭтоСписокЦБ;
	
КонецПроцедуры
